{
    "page": {
      "screenname": "investing",
      "articleNav": [
        {
          "to": "3",
          "name": "The Eighth Wonder of the world"
        },
        {
          "to": "49",
          "name": "Start Investing"
        },
        {
          "to": "50",
          "name": "Investment Portfolio"
        }
      ],
      "articles": [
        {
          "id": "3",
          "articletitle": "The Eighth Wonder of the world",
          "video": null,
          "contents": [
            "When you start to spend less than you earn it gives yourself more choices. One of those choices are to invest. Investing has really become a buzz word these days for making money especially quick money. Investing is putting your money to work, and with that comes risk, cost, and choices. Why should you invest? In today's world with low interest rates at the bank, Inflation eats away your money if it is sitting still. How much can $100 make? Your current $100 can get you a few things, but would you be willing to wait years to have double, triple, or quadruple that amount even with considering inflation? What will it take for you to part with your $100?",
            "So how much money can $100 dollars make in 30 years at an interest rate of 6%? Well, your single $100 can make $475 becoming worth $575 - $210 for inflation your $100 can now buy almost four times at much as when you first started. So, what is the big deal, is four times the money worth it? Let's paint another story currently the average interest rate on the stock market, which mean if you the whole market and do nothing you will get a return of 10% each year. Taking our $100 making 10% each year for 30 years how much more buying power does it have? It will have about 15 times or be worth about $1500 at the end of 30 years. Incredible! ",
            "Now let's see what happens if you our $100 stops making money after 15 years. It will be worth less than three times as much after inflation. Surprise! Wait, I am sure you made a mistake after 15 years it only is worth 3 times, what happened to my 15 times the amount? What did we just learn? Time in the market makes an exponential difference. Think of an exponential curve they are only two ways to get higher up on that curve time and money. Do a search for compound interest calculators and see how many ways you can get to a million dollars. See what happens if you change the interest rate by 2%, or the length by a couple years, or even the starting initial amount. Try to come up with situations that describe you currently and situations that describe your dreams. You can do it, Go do it!"
          ],
          "quotes": [
            "Sitting money to money losing power. What will it take for you to part with your $100?",
            "How many ways can you get to one million dollars by making small adjustment?"
          ]
        },
        {
          "id": "49",
          "articletitle": "Start Investing",
          "video": {
            "videoid": "19",
            "title": "Buying On M1",
            "source": "https://www.youtube.com/embed/lGp8gCTWMq8",
            "files": []
          },
          "contents": [
            "Now you have begun to see the power of your money compounding and how time can affect your compounding results. I think the stock market and real estate are good places to start investing. This article will only talk about the stock market. Within the stock market area, there are hundreds of ways one can invest. The first way discussed is a good option to begin with, especially for those that don’t care for the ins and outs and companies and getting a little percent more. ",
            "In today’s world, an ETF is like the modern mutual fund which is a group of stocks all in one place. An EFT is great because they generally have the lowest fees or expense ratios. An index is a special kind of group of stocks that simply buy and hold the group of stocks it tracks. Common indexes are S&P 500, DOW, and Nasdaq. All of these are considered large-cap indexes which mean huge companies that make millions each year and that are not likely to go out of business. Another thing about indexes that as companies decrease in revenue and worth, they will drop out of the index. There are also mid and small-cap indexes for smaller companies but neither of these indexes will have startup companies there are more stable than those types of companies. Index ETFs are a good way to begin investing in the stock market and require no maintenance and little to no homework. You can buy a large-cap index and small-cap index and buy those two ETF Indexes and for most people, that’s all you care to manage.",
            "You can pick your favorite large-cap and small-cap indexes and buy those ETF’s. I have bought VTI and IJR as of 2021 but any index in those categories will work just fine.  Lastly, I want to bring up risk, to me risk is the chance your money will go to zero. When investing in indexes the chance your money goes to zero is just about zero. Since the indexes will stop buying companies that are losing money before they go to zero one of the only chances of your money going to zero if the whole economy collapses as we know it today. If this happened, I don’t think any kind of investing in the stock market will save you from the chaos. I also think this is not a practical event of happening to it will not stop me from investing in the stock market. I think over the past 50 years the largest drop has been 50% and in more recent years it has been closer to 30-40%. What always has happened though is that the stock market has recovered and exceeded the loss within 15 years, but in recent years it has become more of 3-5 years or less. Therefore, if time is on your side there is almost zero risk in investing in index ETF’s. You can read more about <a href=\" https://jlcollinsnh.com/2012/04/19/stocks-part-ii-the-market-always-goes-up/\" class=\"inlineLink\" target=\"_blank\" rel=\"noopener noreferrer\" > the stock market always going up with Jim Collins </a>. Ready or not watch the video demonstrating how to buy a couple of index ETF’s with m1Finance. "
          ],
          "quotes": [
            "",
            "ETF Indexes will get you a good return, have low fees, and are diversified."
          ]
        },
        {
          "id": "50",
          "articletitle": "Investment Portfolio",
          "video": null,
          "contents": [
            "How should you allocate your investment portfolio? This all depends on how much time you want to put towards investing. First, those that are beginners and don’t care to know the companies they are investing in. Index ETFs will probably work for you pick a small-cap and large-cap ETF index and go 50/50. If you want to allow for more possible with a little increase in risk, you could add an emerging market and/or REITs ETF index. You if like to stick to just the small and large-cap indexes you could also look to add some small and large-cap value, grow, or blend to add more diversity. All of that is simply set your allocations and invest in money and that’s all you must worry about if that all you want to do.",
            " For those that want to do a little more work, I think setting aside a percentage of your portfolio to speculative investments that could double in a year. These could be single stocks, cryptocurrencies, SPACS, options, or other investments that are often considered high risk meaning a chance to lose all your money. A good percentage is a small even percent that if it did go to zero your portfolio would not be greatly reduced, but a high enough percentage that if it doubled it would have a significant value or meaning. For me, I think about 10% is a number that will work for me. That percentage may be lower or high depending on you. This allows you to explore and have some fun.",
            "Option number 3 you can trust what some else is telling you have hope to make a couple of percent more than the market by buying a hand pick of individual company stock, or options. You may pay a guru for their option and hope for the best. You may want to spend hours looking for the best companies that will 4x in the next couple of years. This option will require more of your time, will have the greatest risk, but will have a higher potential return too.",
            "Whatever you choose you must have an investment plan. How much and how often will you contribute to investments? Is there a way to automate this? What will you do if your investments drop by 20-50% in a couple of months? What will you do if your investments double in one year? Before you begin write down your investment plan. Then each time you want to change what you buy/sell review your investment plan before making any fast emotional decisions. And if you want to change your investment plan after a little experience then do so, but once again take it slow and don’t make any fast emotional decisions, know exactly why you are buying or selling. ",
            "Lastly, how do you get out? You only want to sell a large portion of your investments when they have met their purpose and you are ready to buy whatever you were investing for, or retirement is about five or so years away. Don’t worry about your exit plan yet because 20-30 years down the road it will change and maybe even become obsolete. In general, just because you are retiring does not mean you stop doing what worked for you for the past 20+ years. You will still have many years for your money to grow, therefore I think when you retire you should plan on still investing a large portion of your portfolio in the stock market. There are many ideas on how you can still invest in the stock market and limit your exposure to the volatility of the stock market for a portion of your portfolio you will need soon. You could easily do this by investing 10-25% of your portfolio in bonds when you are able to retire. Once again don’t stress about your exit plan you will have 20+ years to see how technology changes and the new greatest ideas of how to maximize your investment portfolio when you retire. Start by investing even if it is only $100!"
          ],
          "quotes": [
            "",
            "",
            "",
            ""
          ]
        }
      ]
    }
}